app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    if @article.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at", "image", "quantity") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Bubbles"], ["text", "2.05"], ["created_at", "2020-11-03 22:37:51.101729"], ["updated_at", "2020-11-03 22:37:51.101729"], ["image", ""], ["quantity", 3]]

  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "articles" SET "text" = ?, "image" = ?, "quantity" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["text", "5.00 / bubble"], ["image", ""], ["quantity", 6], ["updated_at", "2020-11-03 20:25:15.341792"], ["id", 9]]