app/controllers/carts_controller.rb

  def index
    @cart = Cart.all
---
SELECT "carts".* FROM "carts"

  def new
    @article = Article.find(params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

  def edit
    @cart = Cart.find(params[:id])
    @article = Article.find(@cart.articleid)
---
SELECT  "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

  def create
    @cart = Cart.new(cart_params)

    if @cart.save
---
INSERT INTO "carts" ("item", "price", "created_at", "updated_at", "quantity", "image", "articleid") VALUES (?, ?, ?, ?, ?, ?, ?)  [["item", "Cereal"], ["price", "5"], ["created_at", "2020-11-06 22:38:16.341643"], ["updated_at", "2020-11-06 22:38:16.341643"], ["quantity", 4], ["image", "cereal.png"], ["articleid", 7]]

  def update
    @cart = Cart.find(params[:id])

    if @cart.update(cart_params)
---
SELECT  "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "carts" SET "quantity" = ?, "updated_at" = ? WHERE "carts"."id" = ?  [["quantity", 2], ["updated_at", "2020-11-06 22:38:26.350151"], ["id", 1]]

  def destroy
    @cart = Cart.find(params[:id])
    @cart.destroy
---
SELECT  "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 1]]