app/controllers/cart_controller.rb

  def index
    if(params[:id])
      @article = Article.find(params[:id])
      @cart = Cart.new(:id => @article.id, :item => @article.title, :price => @article.text)
      @cart.save
    end

    @cart = Cart.all
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
INSERT INTO "carts" ("id", "item", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["id", 7], ["item", "Cereal"], ["price", "5"], ["created_at", "2020-11-03 21:41:02.029004"], ["updated_at", "2020-11-03 21:41:02.029004"]]
SELECT "carts".* FROM "carts"