app/controllers/items_controller.rb

  def show
    @item = Item.find(params[:id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def create
    @item = Item.new(item_params)
    @item.save
---
INSERT INTO "items" ("image", "description", "quantity", "cost", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)