app/controllers/search_controller.rb

  def index
    @articles = Article.all
---
SELECT "articles".* FROM "articles" WHERE (lower(title) LIKE 'Beef')